* Day 1.2

#+BEGIN_SRC elisp
  (defun calc-fuel2 (m)
    (if (<= m 6)
        0
        (setq x (- (floor (/ m 3)) 2))
        (+ x (calc-fuel2 x))))

  (calc-fuel2 14)
  (calc-fuel2 1969)
  (calc-fuel2 100756)

  (seq-reduce #'+ (seq-map #'calc-fuel2 modules) 0)

#+END_SRC

#+RESULTS:
: 5083370

* Day 2.1

#+BEGIN_SRC elisp
  (setq input [1 12 2 3 1 1 2 3 1 3 4 3 1 5 0 3 2 10 1 19 1 5 19 23 1 23 5 27 1 27 13 31 1 31 5 35 1 9 35 39 2 13 39 43 1 43 10 47 1 47 13 51 2 10 51 55 1 55 5 59 1 59 5 63 1 63 13 67 1 13 67 71 1 71 10 75 1 6 75 79 1 6 79 83 2 10 83 87 1 87 5 91 1 5 91 95 2 95 10 99 1 9 99 103 1 103 13 107 2 10 107 111 2 13 111 115 1 6 115 119 1 119 10 123 2 9 123 127 2 127 9 131 1 131 10 135 1 135 2 139 1 10 139 0 99 2 0 14 0])

  (defun intcomputer (idx)
    (setq opcode (elt input idx))
    (cond ((= 99 opcode)
           (print input))
          ((= 1 opcode)
           (aset input (elt input (+ 3 idx)) (+ (elt input (elt input (+ 1 idx))) (elt input (elt input (+ 2 idx)))))
           (intcomputer (+ 4 idx)))
          ((= 2 opcode)
           (aset input (elt input (+ 3 idx)) (* (elt input (elt input (+ 1 idx))) (elt input (elt input (+ 2 idx)))))
            (intcomputer (+ 4 idx)))))

  (intcomputer 0)

#+END_SRC

#+RESULTS:
: [3562624 12 2 2 1 1 2 3 1 3 4 3 1 5 0 3 2 10 1 48 1 5 19 49 1 23 5 50 1 27 13 55 1 31 5 56 1 9 35 59 2 13 39 295 1 43 10 299 1 47 13 304 2 10 51 1216 1 55 5 1217 1 59 5 1218 1 63 13 1223 1 13 67 1228 1 71 10 1232 1 6 75 1234 1 6 79 1236 2 10 83 4944 1 87 5 4945 1 5 91 4946 2 95 10 19784 1 9 99 19787 1 103 13 19792 2 10 107 79168 2 13 111 395840 1 6 115 395842 1 119 10 395846 2 9 123 1187538 2 127 9 3562614 1 131 10 3562618 1 135 2 3562620 1 10 139 0 99 2 0 14 0]
